{"meta":{"title":"Yunhai","subtitle":"Yunhai Medical Instrument Co., Ltd","description":"","author":"Danjie Liu","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"About us","slug":"About us","date":"2020-04-29T02:34:59.550Z","updated":"2020-04-29T07:48:13.853Z","comments":true,"path":"2020/04/29/uncategorized/About us/","link":"","permalink":"http://yoursite.com/2020/04/29/uncategorized/About%20us/","excerpt":"","text":"What Yunhai Medical Instrument Co., Ltd Supply? Guangzhou Yunhai help clients find his or her own demand for medical devices, and find solutions for their that best fit their unique identity. This is Danjie Liu from Guangzhou Yunhai Medical Instrument as CEO and Co-Founder. Guangzhou Yunhai Medical Instrument Co., Ltd. Yunhai incorporated in 2020 in Guangzhou City, was first established as a manufacturer of disposable medical masks, medical surgical masks, surgical gown and other medical instrument. It is now one of the pioneers who specialize in producing masks, surgical gown and protective suit, such as FFP2, FFP1 Masks, N95 with NIOSH Certification, KN95, Surgical masks, Medical masks. What Yunhai Medical Inc offers:As an internationally proven integrated medical instrument manufacturer, Yunhai offers a complete range of medical instrument these categories:-(1) N95/KN95 Masks-(2) Surgical masks/medical masks/disposable masks-(3) PP, SMS Surgical gown-(4) LED UV Sterilizer light-(5) Mobile phone sterilizer box Drop-shopping, support your E-commercial business Factory produce Certification approved Easy and quick change-over Less power consumption High Rereturn on profit ■Start-to-finish purchasement guidance &amp; Instruction■One-on-one free purchasement project feasibility consultation■One-on-one free costs evaluation■Raw material purchasing Guangzhou Yunhai help clients find his or her own demand for medical devices, and find solutions for their that best fit their unique identity.If you are a start-up or a green hand on medical instrument such as masks or surgical gown/lab suit/protective coverall, this may be the most important company you have ever read. Email: yunhai.co@outlook.com https://yunhai2020.en.alibaba.com You won’t be disappointed.","categories":[],"tags":[]}],"categories":[],"tags":[]}